{
  "hello": "Hallo, ich bin",
  "services": "Leistungen",
  "about": "Über mich",
  "skills": "Fähigkeiten",
  "projects": "Projekte",
  "testimonials": "Kundenstimmen",
  "contact": "Kontakt",
  "intro.bio": "Mein Name ist Youssef, ich bin 26 Jahre alt und IT-Entwickler mit einer tiefen Leidenschaft dafür, Dinge zu erschaffen, die wirklich funktionieren. Was als Neugier für digitale Systeme begann, entwickelte sich schnell zu einem Antrieb, durch sauberen, funktionalen Code echte Lösungen zu schaffen. Ich liebe die technische Herausforderung — doch noch mehr liebe ich es, wenn eine Idee zum Leben erwacht und Wirkung zeigt. Für mich ist jede Codezeile ein Schritt in Richtung einer reibungsloseren, intelligenteren und effizienteren Nutzererfahrung.",
  "hireMe": "Stellen Sie mich ein",
  "downloadResume": "Lebenslauf herunterladen",
  "saasCompanies": "SaaS-Unternehmen",
  "saasDescription": "Ich entwickle skalierbare, komponentenbasierte Frontends und integriere leistungsstarke APIs, um Ihr SaaS-Wachstum zu unterstützen.",
  "documentationTitle": "Dokumentation & Entwicklerhandbücher",
  "documentationDescription": "Klare, strukturierte Dokumentation, die die Einführung Ihres Produkts erleichtert – für Nutzer und Entwickler gleichermaßen.",
  "appsTitle": "Progressive Web- und Mobile-Apps",
  "appsDescription": "Schnell ladende, plattformübergreifende Apps mit nativer Nutzererfahrung – nahtlos auf allen Geräten.",
  "onlineEntrepreneurs": "Online-Unternehmer",
  "bookingDescription": "Individuelle Buchungssysteme, Zahlungsabläufe und Funnels – entwickelt, um Verkauf, Conversion und Automatisierung zu verbessern.",
  "localBusinesses": "Lokale Unternehmen",
  "portalsDescription": "Intelligente Kundenportale und interne Tools, die Zeit sparen und Ihre Arbeitsabläufe vereinfachen.",
  "startups": "Start-ups",
  "mvpDescription": "Ich helfe Ihnen, schnell mit zuverlässigen MVPs zu starten – entwickelt zum Validieren, Iterieren und sicheren Skalieren.",
  "education": "Meine Ausbildung",
  "school": "AP Hochschule Antwerpen",
  "program": {
    "graduate": "Graduiertenlehrgang Programmierung",
    "electronics": "Elektronik und IT"
  },
  "more": "Mehr",
  "more.about": "über",
  "me": "mich",
  "aboutDescription": "Kreativer Problemlöser. Liebhaber von sauberem Code. Ich bin Youssef, ein Entwickler, der von Herausforderungen und Einfachheit angetrieben wird.",
  "happyClient": "Zufriedener Kunde",
  "project": "Projekt",
  "yearsExperience": "Jahre Erfahrung",
  "skills.title": "Meine Fähigkeiten",
  "skillsList": {
    "frontend": "Vue.js, Ember.js, Angular, React, React Native, JavaScript, TypeScript, Tailwind CSS, Bootstrap, HTML, CSS",
    "backend": "Node.js, PHP, .NET, Java, Python",
    "databases": "SQL, MongoDB, MySQL",
    "devops": "Linux, Docker",
    "testing": "Cypress",
    "cms": "Wordpress"
  },
  "services.title": "Meine Leistungen",
  "experiences.title": "Meine Erfahrungen",
  "selfEmployed": "Selbstständig",
  "present": "Heute",
  "latestProjects": "Meine neuesten Projekte",
  "all": "Alle",
  "webDevelopment": "Webentwicklung",
  "mobileApp": "Mobile App",
  "bookingTitle": "Buchungssystem",
  "bookingDescriptionLong": "Entwicklung einer vollständigen Buchungsplattform mit sicherem Login, Admin-Dashboard und Echtzeit-Reservierungen für Dienstleistungen wie Saunas und Hochzeitsdekoration.",
  "mediaDescription": "Medienplattform mit Vue.js und GraphQL zur schnellen Verwaltung und Suche digitaler Dateien für Unternehmen.",
  "agencyTitle": "Innenministerium-Portal",
  "agencyDescription": "Entwicklung eines dezentralisierten Portals, das Kommunen die sichere Verwaltung lokaler Daten ermöglicht und Verwaltungsaufwand reduziert.",
  "automationTitle": "Sitzplatz-Testautomatisierung",
  "automationDescription": "Automatisierte Cypress-Tests für Sitzplatzauswahl zur Vereinfachung von Releases und Sicherstellung der Performance.",
  "iiifTitle": "IIIF-Anmerkungstool (PoC)",
  "iiifDescription": "Ein Forschungsprototyp mit Vue.js und IIIF, der es Benutzern ermöglicht, Bilder interaktiv zu annotieren und bestimmte Bereiche in digitalen Archiven zu markieren.",
  "clientAppTitle": "Kunden-Buchungs-App",
  "clientAppDescription": "Mobile App zum Durchsuchen, Buchen und Verwalten von Terminen – intuitiv, schnell und responsiv.",
  "letsConnect": "Lass uns verbinden",
  "contactDescription": "Ob Projektidee, Feedback oder einfach nur ein Hallo – ich freue mich auf den Kontakt. Ich baue skalierbare Web- und Mobile-Anwendungen mit Fokus auf Performance und Nutzererlebnis.",
  "form": {
    "email": "EMail",
    "phone": "Telefon",
    "linkedin": "LinkedIn",
    "subject": "Betreff",
    "message": "Nachricht",
    "topicPlaceholder": "Lass uns reden über...",
    "send": "Nachricht senden"
  },
  "footer": {
    "rights": "Alle Rechte vorbehalten."
  },
  "testimonial": {
    "1": "Youssef hat genau das geliefert, was ich brauchte — eine schnelle, reaktionsfähige und moderne Web-App. Die Kommunikation war reibungslos und die Codequalität übertraf alle Erwartungen!",
    "2": "Wir waren äußerst beeindruckt von der Art und Weise, wie er unser Projekt umgesetzt hat. Von der Planung bis zur Auslieferung war alles absolut stimmig. Sehr zu empfehlen für anspruchsvolle Entwicklungsarbeiten.",
    "3": "Er hat nicht nur eine beeindruckende mobile Oberfläche entwickelt, sondern auch die Performance über unsere Erwartungen hinaus optimiert. Unsere Nutzer lieben die neue Version.",
    "4": "Zuverlässig, schnell und äußerst kompetent. Youssef hat sowohl das Frontend als auch das Backend einwandfrei umgesetzt. Wir werden definitiv wieder mit ihm arbeiten.",
    "5": "Das von ihm eingerichtete automatisierte Test-Setup hat uns viele Stunden manueller QA erspart. Klare Struktur, hervorragende Dokumentation und durchgehend hilfreicher Support.",
    "6": "Von Anfang bis Ende war es eine professionelle Zusammenarbeit. Sein Verständnis für Full-Stack-Entwicklung ist beeindruckend und spiegelt sich im Endergebnis deutlich wider."
  }
}
