{
  "hello": "Salut, je suis",
  "services": "Services",
  "about": "À propos de moi",
  "skills": "Compétences",
  "projects": "Projets",
  "testimonials": "Témoignages",
  "contact": "Contact",
  "intro.bio": "Je m’appelle Youssef, j’ai 26 ans et je suis développeur informatique avec une véritable passion pour la création de solutions qui fonctionnent vraiment. Ma curiosité pour le fonctionnement des systèmes numériques s’est rapidement transformée en un désir de créer des solutions concrètes avec un code propre et fonctionnel. J’aime les défis techniques — mais ce que j’aime encore plus, c’est voir une idée prendre vie et avoir un réel impact. Pour moi, chaque ligne de code rapproche l’expérience utilisateur d’une version plus fluide, plus intelligente et plus efficace.",
  "hireMe": "Engagez-moi",
  "downloadResume": "Télécharger le CV",
  "saasCompanies": "Entreprises SaaS",
  "saasDescription": "Je développe des frontends modulaires et évolutifs, et j’intègre des API puissantes pour soutenir la croissance de votre SaaS.",
  "documentationTitle": "Documentation & guides développeur",
  "documentationDescription": "Une documentation claire et structurée qui facilite l’adoption de votre produit – pour les utilisateurs comme pour les développeurs.",
  "appsTitle": "Applications Web progressives et mobiles",
  "appsDescription": "Des applications ultra-rapides et multiplateformes, avec une expérience native fluide sur tous les appareils.",
  "onlineEntrepreneurs": "Entrepreneurs en ligne",
  "bookingDescription": "Systèmes de réservation sur mesure, parcours de paiement et tunnels de vente conçus pour vous aider à vendre, convertir et automatiser.",
  "localBusinesses": "Entreprises locales",
  "portalsDescription": "Portails clients intelligents et outils internes qui vous font gagner du temps et simplifient votre flux de travail.",
  "startups": "Startups",
  "mvpDescription": "Je vous aide à lancer rapidement des MVP fiables – conçus pour valider, itérer et évoluer en toute confiance",
  "education": "Ma formation",
  "school": "Haute École AP Anvers",
  "program": {
    "graduate": "Graduat en programmation",
    "electronics": "Électronique et TIC"
  },
  "more": "En savoir",
  "more.about": "Sur",
  "me": "Moi",
  "aboutDescription": "Résolveur de problèmes créatif. Passionné par le code propre. Je suis Youssef, un développeur motivé par les défis et la simplicité. Qu’il s’agisse d’un système de réservation ou d’une application mobile, je transforme des idées complexes en expériences numériques fluides et efficaces.",
  "happyClient": "Client satisfait",
  "project": "Projet",
  "yearsExperience": "Années d’expérience",
  "skills.title": "Mes compétences",
  "skillsList": {
    "frontend": "Vue.js, Ember.js, Angular, React, React Native, JavaScript, TypeScript, Tailwind CSS, Bootstrap, HTML, CSS",
    "backend": "Node.js, PHP, .NET, Java, Python",
    "databases": "SQL, MongoDB, MySQL",
    "devops": "Linux, Docker",
    "testing": "Cypress",
    "cms": "Wordpress"
  },
  "services.title": "Mes Services",
  "experiences.title": "Mes expériences",
  "companies": {
    "selfEmployed": "Travailleur indépendant",
    "inuits": "Inuits, Anvers",
    "beego": "Beego, Anvers"
  },
  "dates": {
    "nov2024Present": "Nov 2024 – Aujourd’hui",
    "feb2023Sep2024": "Fév 2023 – Sep 2024",
    "mar2021Mar2022": "Mar 2021 – Mar 2022"
  },
  "present": "Aujourd’hui",
  "latestProjects": "Mes projets récents",
  "all": "Tous",
  "webDevelopment": "Développement web",
  "mobileApp": "Application mobile",
  "bookingTitle": "Système de gestion des réservations",
  "bookingDescriptionLong": "Développement d'une plateforme de réservation complète avec connexion sécurisée, tableau de bord administrateur et flux de réservation en temps réel pour des services comme les saunas et les décorateurs de mariage.",
  "mediaDescription": "Création d'une plateforme de gestion de médias avec Vue.js et GraphQL, permettant aux utilisateurs professionnels de téléverser, taguer et récupérer des fichiers numériques rapidement et efficacement.",
  "agencyTitle": "Portail du ministère de l’Intérieur",
  "agencyDescription": "Création d’un portail décentralisé permettant aux communes de gérer leurs données locales de manière sécurisée et autonome, réduisant la complexité administrative et les retards.",
  "automationTitle": "Automatisation des tests de sélection de sièges",
  "automationDescription": "Tests Cypress automatisés pour la sélection des sièges afin d’accélérer les déploiements, d’améliorer la couverture et de garantir des performances stables et cohérentes à chaque mise à jour.",
  "iiifTitle": "IIIF Annotation Tool (PoC)",
  "iiifDescription": "Prototype de recherche développé avec Vue.js et IIIF permettant aux utilisateurs d’annoter des images de manière interactive et de marquer des zones spécifiques dans des archives numériques.",
  "clientAppTitle": "Application client de réservation",
  "clientAppDescription": "Conception d'une application mobile permettant aux clients de consulter, réserver et gérer leurs rendez-vous, avec une interface fluide et intuitive adaptée à une utilisation en déplacement.",
  "letsConnect": "Entrons en contact",
  "contactDescription": "Que vous ayez un projet en tête, une question sur mon travail ou que vous souhaitiez simplement dire bonjour — je suis toujours ouvert à la discussion. Je suis spécialisé dans la création d'applications web et mobiles modernes et évolutives, avec un fort accent sur la performance et l’expérience utilisateur. Construisons quelque chose de formidable ensemble.",
  "form": {
    "email": "E-mail",
    "phone": "Téléphone",
    "linkedin": "LinkedIn",
    "subject": "Objet",
    "message": "Message",
    "topicPlaceholder": "Parlons de...",
    "send": "Envoyer le message"
  },
  "footer": {
    "rights": "Tous droits réservés."
  },
  "testimonial": {
    "1": "Youssef a livré exactement ce dont j'avais besoin — une application web rapide, réactive et moderne. La communication a été fluide et la qualité du code a dépassé mes attentes !",
    "2": "TTrès impressionné par la façon dont il a géré notre projet. De la planification à la livraison, tout était parfaitement exécuté. Fortement recommandé pour tout projet de développement sérieux.",
    "3": "Non seulement il a conçu une interface mobile remarquable, mais il a aussi optimisé les performances au-delà de nos attentes. Nos utilisateurs adorent la nouvelle version.",
    "4": "Fiable, rapide et très compétent. Youssef a géré à la perfection le frontend et le backend. Nous retravaillerons avec lui sans hésiter.",
    "5": "L’environnement de tests automatisés qu’il a mis en place nous a fait gagner des heures de QA manuelle. Structure claire, documentation de qualité et un excellent support tout au long du projet.",
    "6": "Du début à la fin, ce fut une expérience professionnelle. Sa maîtrise du développement full-stack est impressionnante, et cela se reflète dans le résultat final."
  }
}
