{
  "hello": "Salut, je suis",
  "services": "Services",
  "about": "À propos de moi",
  "skills": "Compétences",
  "projects": "Projets",
  "testimonials": "Témoignages",
  "contact": "Contact",
  "intro.bio": "Je m'appelle Youssef, j'ai 26 ans et je suis développeur informatique avec une profonde passion pour créer des solutions qui fonctionnent réellement. Ce qui a commencé par une curiosité pour le fonctionnement des systèmes numériques s'est rapidement transformé en un désir de créer des solutions concrètes à l'aide d'un code propre et fonctionnel. J’aime les défis techniques — mais encore plus le moment où une idée prend vie et a un impact réel. Pour moi, chaque ligne de code rapproche l’expérience utilisateur d’une version plus fluide, plus intelligente et plus efficace.",
  "hireMe": "Engagez-moi",
  "downloadResume": "Télécharger le CV",
  "saasCompanies": "Entreprises SaaS",
  "saasDescription": "Je crée des frontends évolutifs et modulaires et j'intègre des API puissantes pour soutenir la croissance de votre SaaS.",
  "documentationTitle": "Documentation & guides développeur",
  "documentationDescription": "Une documentation claire et structurée qui facilite l’adoption de votre produit – pour les utilisateurs comme pour les développeurs.",
  "appsTitle": "Applications Web progressives et mobiles",
  "appsDescription": "Des applications rapides et multiplateformes offrant une expérience native fluide sur tous les appareils.",
  "onlineEntrepreneurs": "Entrepreneurs en ligne",
  "bookingDescription": "Systèmes de réservation personnalisés, flux de paiement et tunnels de conversion conçus pour vous aider à vendre, convertir et automatiser.",
  "localBusinesses": "Entreprises locales",
  "portalsDescription": "Portails clients intelligents et outils internes qui vous font gagner du temps et simplifient vos processus.",
  "startups": "Start-ups",
  "mvpDescription": "Je vous aide à lancer rapidement des MVP fiables — conçus pour valider, itérer et évoluer en toute confiance.",
  "education": "Ma formation",
  "school": "Haute École AP Anvers",
  "program": {
    "graduate": "Graduat en programmation",
    "electronics": "Électronique et TIC"
  }, 
  "more": "En savoir",
  "more.about": "Sur",
  "me": "Moi",
  "aboutDescription": "Résolveur de problèmes créatif. Passionné de code propre. Je suis Youssef, un développeur motivé par les défis et la simplicité.",
  "happyClient": "Client satisfait",
  "project": "Projet",
  "yearsExperience": "Années d’expérience",
  "skills.title": "Mes compétences",
  "services.title": "Mes Services",
  "experiences.title": "Mes expériences",
  "selfEmployed": "Travailleur indépendant",
  "present": "Aujourd’hui",
  "latestProjects": "Mes projets récents",
  "all": "Tous",
  "webDevelopment": "Développement Web",
  "mobileApp": "Application mobile",
  "bookingTitle": "Système de gestion des réservations",
  "bookingDescriptionLong": "Développement d'une plateforme complète de réservation avec connexion sécurisée, tableau de bord administrateur et flux de réservation en temps réel pour des services tels que les saunas et les décorateurs de mariage.",
  "mediaDescription": "Création d'une plateforme de gestion de médias avec Vue.js et GraphQL, permettant aux entreprises de télécharger, taguer et rechercher efficacement leurs fichiers numériques.",
  "agencyTitle": "Portail du ministère de l’Intérieur",
  "agencyDescription": "Mise en place d’un portail décentralisé permettant aux communes de gérer leurs données locales de manière sécurisée et autonome, réduisant ainsi la complexité administrative.",
  "automationTitle": "Automatisation des tests de sélection de sièges",
  "automationDescription": "Automatisation des tests Cypress pour la sélection de sièges, simplifiant les mises à jour et assurant des performances stables et cohérentes.",
  "iiifTitle": "Outil d’annotation IIIF (PoC)",
  "iiifDescription": "Prototype de recherche développé avec Vue.js et IIIF permettant aux utilisateurs d’annoter des images de manière interactive et de marquer des zones spécifiques dans des archives numériques.",
  "clientAppTitle": "Application client de réservation",
  "clientAppDescription": "Conception d'une application mobile permettant aux clients de parcourir, réserver et gérer leurs rendez-vous avec une interface fluide et intuitive.",
  "letsConnect": "Entrons en contact",
  "contactDescription": "Que vous ayez un projet en tête, une question sur mon travail ou simplement envie de dire bonjour — je suis toujours ouvert aux échanges. Je me spécialise dans la création d’applications web et mobiles évolutives, performantes et centrées sur l’expérience utilisateur.",
  "form": {
    "email": "E-mail",
    "phone": "Téléphone",
    "linkedin": "LinkedIn",
    "subject": "Objet",
    "message": "Message",
    "topicPlaceholder": "Parlons de...",
    "send": "Envoyer le message"
  },
  "footer": {
    "rights": "Tous droits réservés."
  },
  "testimonial": {
    "1": "Youssef a livré exactement ce dont j’avais besoin — une application web rapide, réactive et moderne. La communication était fluide et la qualité du code a dépassé toutes les attentes !",
    "2": "Nous avons été extrêmement impressionnés par la façon dont il a mené notre projet. De la planification à la livraison, tout a été parfaitement orchestré. Fortement recommandé pour tout travail de développement sérieux.",
    "3": "Il a non seulement créé une interface mobile impressionnante, mais a aussi optimisé les performances bien au-delà de nos attentes. Nos utilisateurs adorent la nouvelle version.",
    "4": "Fiable, rapide et très compétent. Youssef a parfaitement géré le frontend et le backend. Nous retravaillerons avec lui sans hésitation.",
    "5": "Le système de tests automatisés qu'il a mis en place nous a fait économiser de nombreuses heures de tests manuels. Structure propre, excellente documentation et assistance toujours disponible.",
    "6": "Du début à la fin, une collaboration professionnelle. Son expertise full-stack est impressionnante et se reflète clairement dans le résultat final."
  }
}
