{
  "hello": "Hoi, ik ben",
  "services": "Diensten",
  "about": "Over mij",
  "skills": "Vaardigheden",
  "projects": "Projecten",
  "testimonials": "Klantervaringen",
  "contact": "Contact",
  "intro.bio": "Mijn naam is Youssef, ik ben 26 jaar en IT-ontwikkelaar met een diepe passie voor het bouwen van oplossingen die echt werken. Wat begon als nieuwsgierigheid naar digitale systemen, groeide al snel uit tot een drang om echte oplossingen te creëren via schone, functionele code. Ik hou van de technische uitdaging — maar nog meer van het moment waarop een idee tot leven komt en impact maakt. Voor mij brengt elke regel code ons dichter bij een soepelere, slimmere en efficiëntere gebruikerservaring.",
  "hireMe": "Huur mij in",
  "downloadResume": "CV downloaden",
  "saasCompanies": "SaaS-bedrijven",
  "saasDescription": "Ik bouw schaalbare, componentgebaseerde frontends en integreer krachtige API’s om jouw SaaS-groei te ondersteunen.",
  "documentationTitle": "Documentatie & ontwikkelaarsgidsen",
  "documentationDescription": "Duidelijke, gestructureerde documentatie die het gebruik van jouw product vergemakkelijkt – voor zowel gebruikers als ontwikkelaars.",
  "appsTitle": "Progressive Web- en mobiele apps",
  "appsDescription": "Supersnelle, platformonafhankelijke apps die aanvoelen als native en naadloos werken op elk apparaat.",
  "onlineEntrepreneurs": "Online ondernemers",
  "bookingDescription": "Aangepaste boekingssystemen, betalingsstromen en funnels — ontworpen om je te helpen verkopen, converteren en automatiseren.",
  "localBusinesses": "Lokale bedrijven",
  "portalsDescription": "Slimme klantportalen en interne tools die je tijd besparen en je workflow vereenvoudigen.",
  "startups": "Start-ups",
  "mvpDescription": "Ik help je snel lanceren met betrouwbare MVP’s – gebouwd om te valideren, itereren en met vertrouwen op te schalen.",
  "education": "Mijn opleiding",
  "school": "AP Hogeschool Antwerpen",
    "program": {
    "graduate": "Graduaat Programmeren",
    "electronics": "Elektronica & ICT"
  }, 
  "more": "Meer",
  "more.about": "Over",
  "me": "Me",
  "aboutDescription": "Creatieve probleemoplosser. Fan van schone code. Ik ben Youssef, een ontwikkelaar die wordt gedreven door uitdaging en eenvoud.",
  "happyClient": "Tevreden klanten",
  "project": "Project",
  "yearsExperience": "Jaar ervaring",
  "skills.title": "Mijn vaardigheden",
  "services.title": "Mijn Diensten",
  "experiences.title": "Mijn ervaringen",
  "selfEmployed": "Zelfstandig",
  "present": "Heden",
  "latestProjects": "Mijn nieuwste projecten",
  "all": "Alles",
  "webDevelopment": "Webontwikkeling",
  "mobileApp": "Mobiele app",
  "bookingTitle": "Boekingsbeheersysteem",
  "bookingDescriptionLong": "Ontwikkeld een volledige boekingsplatform met beveiligde login, beheerdersdashboard en real-time reserveringsstroom voor diensten zoals sauna’s en trouwdecorateurs.",
  "mediaDescription": "Gecreëerd een mediabeheerplatform met Vue.js en GraphQL waarmee bedrijven snel digitale bestanden kunnen uploaden, taggen en terugvinden.",
  "agencyTitle": "Portaal voor Binnenlandse Zaken",
  "agencyDescription": "Gebouwd een gedecentraliseerd portaal waarmee gemeenten hun lokale data veilig en autonoom kunnen beheren, waardoor administratieve complexiteit verminderd wordt.",
  "automationTitle": "Testautomatisering voor zitplaatsen",
  "automationDescription": "Automatiseerde Cypress-tests voor zitplaatsselectie om releases te stroomlijnen, dekking te verhogen en consistente prestaties te garanderen.",
  "iiifTitle": "IIIF Annotatietool (PoC)",
  "iiifDescription": "Een onderzoeksprototype gebouwd met Vue.js en IIIF waarmee gebruikers afbeeldingen interactief kunnen annoteren en specifieke gebieden binnen digitale archieven kunnen taggen.",
  "clientAppTitle": "Klant boekingsapp",
  "clientAppDescription": "Ontworpen een mobiele app waarmee klanten eenvoudig kunnen zoeken, boeken en afspraken beheren met een intuïtieve en soepele interface.",
  "letsConnect": "Laten we verbinden",
  "contactDescription": "Of je nu een projectidee hebt, een vraag over mijn werk of gewoon even hallo wilt zeggen — ik sta altijd open voor contact. Ik specialiseer me in schaalbare, moderne web- en mobiele applicaties met focus op prestaties en gebruikerservaring.",
  "form": {
    "email": "E-mail",
    "phone": "Telefoon",
    "linkedin": "LinkedIn",
    "subject": "Onderwerp",
    "message": "Bericht",
    "topicPlaceholder": "Laten we praten over...",
    "send": "Bericht verzenden"
  },
  "footer": {
    "rights": "Alle rechten voorbehouden."
  },
  "testimonial": {
    "1": "Youssef leverde precies wat ik nodig had — een snelle, responsieve en moderne web-app. De communicatie verliep soepel en de codekwaliteit overtrof alle verwachtingen!",
    "2": "We waren enorm onder de indruk van hoe hij ons project aanpakte. Van planning tot oplevering was alles perfect afgestemd. Zeer aan te bevelen voor serieuze ontwikkelprojecten.",
    "3": "Hij bouwde niet alleen een prachtige mobiele interface, maar optimaliseerde ook de prestaties ruim boven onze verwachtingen. Onze gebruikers zijn dol op de nieuwe versie.",
    "4": "Betrouwbaar, snel en zeer bekwaam. Youssef verzorgde zowel frontend als backend foutloos. We zullen zeker opnieuw met hem samenwerken.",
    "5": "Het geautomatiseerde testsysteem dat hij heeft opgezet, heeft ons vele uren handmatige QA bespaard. Schone structuur, uitstekende documentatie en altijd behulpzame support.",
    "6": "Van begin tot eind was het een professionele samenwerking. Zijn full-stack expertise is indrukwekkend en duidelijk zichtbaar in het eindresultaat."
  }
}
