{
  "hello": "Hallo, ik ben",
  "services": "Diensten",
  "about": "Over mij",
  "skills": "Vaardigheden",
  "projects": "Projecten",
  "testimonials": "Testimonials",
  "contact": "Contact",
  "welcomeHeadline": "Welkom bij SharpCodeLabs – Schaalbare webapplicaties. Tastbare resultaten.",
  "intro.bio": "Mijn naam is Youssef, ik ben 26 jaar en IT-ontwikkelaar met een diepe passie voor het bouwen van oplossingen die écht werken. Wat begon als nieuwsgierigheid naar hoe digitale systemen functioneren, groeide al snel uit tot een drang om echte oplossingen te creëren met behulp van heldere, functionele code. Ik hou van de technische uitdaging — maar nog meer van het moment waarop een idee tot leven komt en daadwerkelijk impact maakt. Voor mij brengt elke regel code ons dichter bij een soepelere, slimmere en efficiëntere ervaring.",
  "hireMe": "Huur mij in",
  "downloadResume": "CV downloaden",
  "saasCompanies": "SaaS bedrijven",
  "saasDescription": "Ik bouw schaalbare, component-gebaseerde frontends en integreer krachtige APIs voor je SaaS groei.",
  "documentationTitle": "Documentatie & Developer Gidsen",
  "documentationDescription": "Duidelijke, gestructureerde documentatie die het product makkelijker maakt voor gebruikers én developers.",
  "appsTitle": "Progressieve Web & Mobile Apps",
  "appsDescription": "Snel ladende, platformonafhankelijke apps met native ervaring.",
  "onlineEntrepreneurs": "Online Ondernemers",
  "bookingDescription": "Aangepaste boekingssystemen, betaalstromen en funnels om verkoop en automatisering te optimaliseren.",
  "localBusinesses": "Lokale bedrijven",
  "portalsDescription": "Slimme klantportalen en interne tools die tijd besparen en workflows vereenvoudigen.",
  "startups": "Startups",
  "mvpDescription": "Ik help je snel live met betrouwbare MVP’s, klaar om te valideren en te schalen.",
  "education": "Mijn Opleiding",
  "school": "AP Hogeschool Antwerpen",
  "program": {
    "graduate": "Graduaat Programmeren",
    "electronics": "Elektronica & ICT"
  },
  "more": "Meer",
  "more.about": "Over",
  "me": "Mij",
  "aboutDescription": "Creatieve probleemoplosser. Fan van heldere code. Ik ben Youssef, een ontwikkelaar die gedreven wordt door uitdaging en eenvoud. Of het nu gaat om een boekingssysteem of een mobiele app — ik vertaal complexe ideeën naar gebruiksvriendelijke digitale ervaringen die gewoon werken.",
  "happyClient": "Tevreden klant",
  "project": "Project",
  "yearsExperience": "Jaren ervaring",
  "skills.title": "Mijn vaardigheden",
  "skillsList": {
    "frontend": "Vue.js, Ember.js, Angular, React, React Native, JavaScript, TypeScript, Tailwind CSS, Bootstrap, HTML, CSS",
    "backend": "Node.js, PHP, .NET, Java, Python",
    "databases": "SQL, MongoDB, MySQL",
    "devops": "Linux, Docker",
    "testing": "Cypress",
    "cms": "Wordpress"
  },
  "services.title": "Mijn diensten",
  "experiences.title": "Mijn ervaringen",
  "companies": {
    "selfEmployed": "Zelfstandig",
    "inuits": "Inuits, Antwerpen",
    "beego": "Beego, Antwerpen"
  },
  "dates": {
    "nov2024Present": "Nov 2024 – heden",
    "feb2023Sep2024": "Feb 2023 – Sep 2024",
    "mar2021Mar2022": "Mrt 2021 – Mrt 2022"
  },
  "present": "Heden",
  "latestProjects": "Mijn nieuwste projecten",
  "all": "Alle",
  "webDevelopment": "Webontwikkeling",
  "mobileApp": "Mobiele app",
  "bookingTitle": "Boekingsplatform",
  "bookingDescriptionLong": "Aangepaste boekingssystemen, betaalflows en funnels – ontworpen om je te helpen verkopen, converteren en automatiseren.",
  "mediaDescription": "Een media-assetplatform gebouwd met Vue.js en GraphQL, waarmee zakelijke gebruikers digitale bestanden snel en efficiënt kunnen uploaden, taggen en terugvinden.",
  "agencyTitle": "Binnenlandse Zaken Portaal",
  "agencyDescription": "Een gedecentraliseerd portaal gebouwd waarin gemeenten lokale gegevens veilig en zelfstandig kunnen beheren, waardoor administratieve complexiteit en vertraging worden verminderd.",
  "automationTitle": "Testautomatisatie stoelkeuze",
  "automationDescription": "Geautomatiseerde Cypress-tests voor stoelselectie om releases te versnellen, testdekking te vergroten en consistente, stabiele prestaties te waarborgen bij updates.",
  "iiifTitle": "IIIF Annotatie Tool (PoC)",
  "iiifDescription": "Een onderzoeksprototype gebouwd met Vue.js en IIIF waarmee gebruikers afbeeldingen interactief kunnen annoteren en specifieke gebieden binnen digitale archieven kunnen taggen.",
  "clientAppTitle": "Klanten Boekings App",
  "clientAppDescription": "Een mobiele app ontworpen waarmee klanten afspraken kunnen bekijken, boeken en beheren — met een soepele en intuïtieve interface voor mobiel gebruik onderweg.",
  "letsConnect": "Laten we connecteren",
  "contactDescription": "Of je nu een project in gedachten hebt, een vraag hebt over mijn werk of gewoon even hallo wilt zeggen — ik sta altijd open voor contact. Ik ben gespecialiseerd in het bouwen van schaalbare, moderne web- en mobiele applicaties met een sterke focus op prestaties en gebruikerservaring. Laten we samen iets moois creëren.",
  "form": {
    "email": "E-mail",
    "phone": "Telefoon",
    "linkedin": "LinkedIn",
    "subject": "Onderwerp",
    "message": "Bericht",
    "topicPlaceholder": "Laten we praten over...",
    "send": "Verstuur"
  },
  "footer": {
    "rights": "Alle rechten voorbehouden."
  },
  "testimonial": {
    "1": "Youssef leverde precies wat ik nodig had — een snelle, responsieve en moderne webapp. De communicatie verliep vlot en de codekwaliteit overtrof alle verwachtingen!",
    "2": "Zeer onder de indruk van de manier waarop hij ons project heeft aangepakt. Van de planning tot de oplevering klopte alles. Sterk aanbevolen voor elk serieus ontwikkeltraject.",
    "3": "Hij bouwde niet alleen een verbluffende mobiele interface, maar optimaliseerde ook de prestaties ver boven onze verwachtingen. Onze gebruikers zijn dol op de nieuwe versie.",
    "4": "Betrouwbaar, snel en zeer bekwaam. Youssef verzorgde zowel de frontend als backend vlekkeloos. We werken in de toekomst zeker opnieuw met hem samen.",
    "5": "De testautomatisering die hij heeft opgezet, bespaarde ons uren aan handmatig testwerk. De structuur was helder, de documentatie uitstekend en de ondersteuning gedurende het hele traject was zeer behulpzaam.",
    "6": "Van begin tot eind was het een professionele ervaring. Zijn kennis van full-stack development is indrukwekkend en dat zie je duidelijk terug in het eindresultaat."
  }
}
